/*
2016/11/21


此为第 1 课的上课内容, 请自行完成


上课内容
---
以编程为主
前端领域用到的其他技术不会花费太多时间就能掌握


上课时间
---
周 2 4 6 晚 7.30 - 9.30


上课方式
---
QQ 群视频，只有手机 QQ 和 Windows QQ 能看到
Mac 不能看到
iPad 需要安装手机 QQ 才能看


上课用软件(会上传至群文件)
---
Atom 编辑器
Chrome 浏览器
Firefox 浏览器


其他
---
不要因为自认为有编程基础就轻视我讲的编程内容
交费、学习用论坛等未尽事宜上课会讲




热身
===

打开下面链接中的页面
http://vip.cocode.cc/arena

页面左边是写代码的编辑窗口
页面右边是运行代码的结果

代码编辑窗口中, 有 2 个预定义的语句可以使用
每条语句独占一行

右边有一个黑色三角箭头
forward(100) 用来把三角箭头往前移动 100 像素
right(90) 用来把三角箭头往右旋转 90 度

例子 1
画一个边长为 101 像素的正三角形的代码如下

forward(101)
right(120)
forward(101)
right(120)
forward(101)
right(120)



-------------------------
题
-------------------------

作业 1
画一个边长为 10 像素的正三角形


作业 2
画一个边长为 99 像素的正方形


作业 3
画一个长宽分别为 168, 99 像素的矩形


作业 4
画一个边长为 33 像素的正三角形


作业 5
画一个边长为 106 像素的正方形


作业 6
画一个长宽分别为 68, 59 像素的矩形


作业 7
画一个边长为 79 的正五边形


作业 8
画一个边长为 63 的正六边形


作业 9
画一个边长为 159 的正七边形


作业 10
画一个边长为 93 的正十边形
*/
